Microchip-MPLAB-Harmony/reference_apps_pic32cm/apps/pic32cm_gm_vl_cnano/pic32cm_gv_vl_cnano_getting_started/firmware/src/packs/PIC32CM3204GV00064_DFP/component/tc.h
/*
 * Component description for TC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2019-11-25T23:26:27Z  */
#ifndef _PIC32CMGV00_TC_COMPONENT_H_
#define _PIC32CMGV00_TC_COMPONENT_H_

/* ************************************************************************** */
/*                       SOFTWARE API DEFINITION FOR TC                       */
/* ************************************************************************** */

/* -------- TC_CTRLA : (TC Offset: 0x00) (R/W 16) Control A -------- */
#define TC_CTRLA_RESETVALUE                   _UINT16_(0x00)                                       /*  (TC_CTRLA) Control A  Reset Value */

#define TC_CTRLA_SWRST_Pos                    _UINT16_(0)                                          /* (TC_CTRLA) Software Reset Position */
#define TC_CTRLA_SWRST_Msk                    (_UINT16_(0x1) << TC_CTRLA_SWRST_Pos)                /* (TC_CTRLA) Software Reset Mask */
#define TC_CTRLA_SWRST(value)                 (TC_CTRLA_SWRST_Msk & (_UINT16_(value) << TC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the TC_CTRLA register */
#define TC_CTRLA_ENABLE_Pos                   _UINT16_(1)                                          /* (TC_CTRLA) Enable Position */
#define TC_CTRLA_ENABLE_Msk                   (_UINT16_(0x1) << TC_CTRLA_ENABLE_Pos)               /* (TC_CTRLA) Enable Mask */
#define TC_CTRLA_ENABLE(value)                (TC_CTRLA_ENABLE_Msk & (_UINT16_(value) << TC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the TC_CTRLA register */
#define TC_CTRLA_MODE_Pos                     _UINT16_(2)                                          /* (TC_CTRLA) TC Mode Position */
#define TC_CTRLA_MODE_Msk                     (_UINT16_(0x3) << TC_CTRLA_MODE_Pos)                 /* (TC_CTRLA) TC Mode Mask */
#define TC_CTRLA_MODE(value)                  (TC_CTRLA_MODE_Msk & (_UINT16_(value) << TC_CTRLA_MODE_Pos)) /* Assignment of value for MODE in the TC_CTRLA register */
#define   TC_CTRLA_MODE_COUNT16_Val           _UINT16_(0x0)                                        /* (TC_CTRLA) Counter in 16-bit mode  */
#define   TC_CTRLA_MODE_COUNT8_Val            _UINT16_(0x1)                                        /* (TC_CTRLA) Counter in 8-bit mode  */
#define   TC_CTRLA_MODE_COUNT32_Val           _UINT16_(0x2)                                        /* (TC_CTRLA) Counter in 32-bit mode  */
#define TC_CTRLA_MODE_COUNT16                 (TC_CTRLA_MODE_COUNT16_Val << TC_CTRLA_MODE_Pos)     /* (TC_CTRLA) Counter in 16-bit mode Position */
#define TC_CTRLA_MODE_COUNT8                  (TC_CTRLA_MODE_COUNT8_Val << TC_CTRLA_MODE_Pos)      /* (TC_CTRLA) Counter in 8-bit mode Position */
#define TC_CTRLA_MODE_COUNT32                 (TC_CTRLA_MODE_COUNT32_Val << TC_CTRLA_MODE_Pos)     /* (TC_CTRLA) Counter in 32-bit mode Position */
#define TC_CTRLA_WAVEGEN_Pos                  _UINT16_(5)                                          /* (TC_CTRLA) Waveform Generation Operation Position */
#define TC_CTRLA_WAVEGEN_Msk                  (_UINT16_(0x3) << TC_CTRLA_WAVEGEN_Pos)              /* (TC_CTRLA) Waveform Generation Operation Mask */
#define TC_CTRLA_WAVEGEN(value)               (TC_CTRLA_WAVEGEN_Msk & (_UINT16_(value) << TC_CTRLA_WAVEGEN_Pos)) /* Assignment of value for WAVEGEN in the TC_CTRLA register */
#define   TC_CTRLA_WAVEGEN_NFRQ_Val           _UINT16_(0x0)                                        /* (TC_CTRLA)   */
#define   TC_CTRLA_WAVEGEN_MFRQ_Val           _UINT16_(0x1)                                        /* (TC_CTRLA)   */
#define   TC_CTRLA_WAVEGEN_NPWM_Val           _UINT16_(0x2)                                        /* (TC_CTRLA)   */
#define   TC_CTRLA_WAVEGEN_MPWM_Val           _UINT16_(0x3)                                        /* (TC_CTRLA)   */
#define TC_CTRLA_WAVEGEN_NFRQ                 (TC_CTRLA_WAVEGEN_NFRQ_Val << TC_CTRLA_WAVEGEN_Pos)  /* (TC_CTRLA)  Position */
#define TC_CTRLA_WAVEGEN_MFRQ                 (TC_CTRLA_WAVEGEN_MFRQ_Val << TC_CTRLA_WAVEGEN_Pos)  /* (TC_CTRLA)  Position */
#define TC_CTRLA_WAVEGEN_NPWM                 (TC_CTRLA_WAVEGEN_NPWM_Val << TC_CTRLA_WAVEGEN_Pos)  /* (TC_CTRLA)  Position */
#define TC_CTRLA_WAVEGEN_MPWM                 (TC_CTRLA_WAVEGEN_MPWM_Val << TC_CTRLA_WAVEGEN_Pos)  /* (TC_CTRLA)  Position */
#define TC_CTRLA_PRESCALER_Pos                _UINT16_(8)                                          /* (TC_CTRLA) Prescaler Position */
#define TC_CTRLA_PRESCALER_Msk                (_UINT16_(0x7) << TC_CTRLA_PRESCALER_Pos)            /* (TC_CTRLA) Prescaler Mask */
#define TC_CTRLA_PRESCALER(value)             (TC_CTRLA_PRESCALER_Msk & (_UINT16_(value) << TC_CTRLA_PRESCALER_Pos)) /* Assignment of value for PRESCALER in the TC_CTRLA register */
#define   TC_CTRLA_PRESCALER_DIV1_Val         _UINT16_(0x0)                                        /* (TC_CTRLA) GCLK_TC  */
#define   TC_CTRLA_PRESCALER_DIV2_Val         _UINT16_(0x1)                                        /* (TC_CTRLA) GCLK_TC/2  */
#define   TC_CTRLA_PRESCALER_DIV4_Val         _UINT16_(0x2)                                        /* (TC_CTRLA) GCLK_TC/4  */
#define   TC_CTRLA_PRESCALER_DIV8_Val         _UINT16_(0x3)                                        /* (TC_CTRLA) GCLK_TC/8  */
#define   TC_CTRLA_PRESCALER_DIV16_Val        _UINT16_(0x4)                                        /* (TC_CTRLA) GCLK_TC/16  */
#define   TC_CTRLA_PRESCALER_DIV64_Val        _UINT16_(0x5)                                        /* (TC_CTRLA) GCLK_TC/64  */
#define   TC_CTRLA_PRESCALER_DIV256_Val       _UINT16_(0x6)                                        /* (TC_CTRLA) GCLK_TC/256  */
#define   TC_CTRLA_PRESCALER_DIV1024_Val      _UINT16_(0x7)                                        /* (TC_CTRLA) GCLK_TC/1024  */
#define TC_CTRLA_PRESCALER_DIV1               (TC_CTRLA_PRESCALER_DIV1_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC Position */
#define TC_CTRLA_PRESCALER_DIV2               (TC_CTRLA_PRESCALER_DIV2_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/2 Position */
#define TC_CTRLA_PRESCALER_DIV4               (TC_CTRLA_PRESCALER_DIV4_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/4 Position */
#define TC_CTRLA_PRESCALER_DIV8               (TC_CTRLA_PRESCALER_DIV8_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/8 Position */
#define TC_CTRLA_PRESCALER_DIV16              (TC_CTRLA_PRESCALER_DIV16_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/16 Position */
#define TC_CTRLA_PRESCALER_DIV64              (TC_CTRLA_PRESCALER_DIV64_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/64 Position */
#define TC_CTRLA_PRESCALER_DIV256             (TC_CTRLA_PRESCALER_DIV256_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/256 Position */
#define TC_CTRLA_PRESCALER_DIV1024            (TC_CTRLA_PRESCALER_DIV1024_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) GCLK_TC/1024 Position */
#define TC_CTRLA_RUNSTDBY_Pos                 _UINT16_(11)                                         /* (TC_CTRLA) Run in Standby Position */
#define TC_CTRLA_RUNSTDBY_Msk                 (_UINT16_(0x1) << TC_CTRLA_RUNSTDBY_Pos)             /* (TC_CTRLA) Run in Standby Mask */
#define TC_CTRLA_RUNSTDBY(value)              (TC_CTRLA_RUNSTDBY_Msk & (_UINT16_(value) << TC_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the TC_CTRLA register */
#define TC_CTRLA_PRESCSYNC_Pos                _UINT16_(12)                                         /* (TC_CTRLA) Prescaler and Counter Synchronization Position */
#define TC_CTRLA_PRESCSYNC_Msk                (_UINT16_(0x3) << TC_CTRLA_PRESCSYNC_Pos)            /* (TC_CTRLA) Prescaler and Counter Synchronization Mask */
#define TC_CTRLA_PRESCSYNC(value)             (TC_CTRLA_PRESCSYNC_Msk & (_UINT16_(value) << TC_CTRLA_PRESCSYNC_Pos)) /* Assignment of value for PRESCSYNC in the TC_CTRLA register */
#define   TC_CTRLA_PRESCSYNC_GCLK_Val         _UINT16_(0x0)                                        /* (TC_CTRLA) Reload or reset Counter on next GCLK  */
#define   TC_CTRLA_PRESCSYNC_PRESC_Val        _UINT16_(0x1)                                        /* (TC_CTRLA) Reload or reset Counter on next prescaler clock  */
#define   TC_CTRLA_PRESCSYNC_RESYNC_Val       _UINT16_(0x2)                                        /* (TC_CTRLA) Reload or reset Counter on next GCLK. Reset prescaler counter  */
#define TC_CTRLA_PRESCSYNC_GCLK               (TC_CTRLA_PRESCSYNC_GCLK_Val << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Reload or reset Counter on next GCLK Position */
#define TC_CTRLA_PRESCSYNC_PRESC              (TC_CTRLA_PRESCSYNC_PRESC_Val << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Reload or reset Counter on next prescaler clock Position */
#define TC_CTRLA_PRESCSYNC_RESYNC             (TC_CTRLA_PRESCSYNC_RESYNC_Val << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Reload or reset Counter on next GCLK. Reset prescaler counter Position */
#define TC_CTRLA_Msk                          _UINT16_(0x3F6F)                                     /* (TC_CTRLA) Register Mask  */


/* -------- TC_READREQ : (TC Offset: 0x02) (R/W 16) Read Request -------- */
#define TC_READREQ_RESETVALUE                 _UINT16_(0x00)                                       /*  (TC_READREQ) Read Request  Reset Value */

#define TC_READREQ_ADDR_Pos                   _UINT16_(0)                                          /* (TC_READREQ) Address Position */
#define TC_READREQ_ADDR_Msk                   (_UINT16_(0x1F) << TC_READREQ_ADDR_Pos)              /* (TC_READREQ) Address Mask */
#define TC_READREQ_ADDR(value)                (TC_READREQ_ADDR_Msk & (_UINT16_(value) << TC_READREQ_ADDR_Pos)) /* Assignment of value for ADDR in the TC_READREQ register */
#define TC_READREQ_RCONT_Pos                  _UINT16_(14)                                         /* (TC_READREQ) Read Continuously Position */
#define TC_READREQ_RCONT_Msk                  (_UINT16_(0x1) << TC_READREQ_RCONT_Pos)              /* (TC_READREQ) Read Continuously Mask */
#define TC_READREQ_RCONT(value)               (TC_READREQ_RCONT_Msk & (_UINT16_(value) << TC_READREQ_RCONT_Pos)) /* Assignment of value for RCONT in the TC_READREQ register */
#define TC_READREQ_RREQ_Pos                   _UINT16_(15)                                         /* (TC_READREQ) Read Request Position */
#define TC_READREQ_RREQ_Msk                   (_UINT16_(0x1) << TC_READREQ_RREQ_Pos)               /* (TC_READREQ) Read Request Mask */
#define TC_READREQ_RREQ(value)                (TC_READREQ_RREQ_Msk & (_UINT16_(value) << TC_READREQ_RREQ_Pos)) /* Assignment of value for RREQ in the TC_READREQ register */
#define TC_READREQ_Msk                        _UINT16_(0xC01F)                                     /* (TC_READREQ) Register Mask  */


/* -------- TC_CTRLBCLR : (TC Offset: 0x04) (R/W 8) Control B Clear -------- */
#define TC_CTRLBCLR_RESETVALUE                _UINT8_(0x02)                                        /*  (TC_CTRLBCLR) Control B Clear  Reset Value */

#define TC_CTRLBCLR_DIR_Pos                   _UINT8_(0)                                           /* (TC_CTRLBCLR) Counter Direction Position */
#define TC_CTRLBCLR_DIR_Msk                   (_UINT8_(0x1) << TC_CTRLBCLR_DIR_Pos)                /* (TC_CTRLBCLR) Counter Direction Mask */
#define TC_CTRLBCLR_DIR(value)                (TC_CTRLBCLR_DIR_Msk & (_UINT8_(value) << TC_CTRLBCLR_DIR_Pos)) /* Assignment of value for DIR in the TC_CTRLBCLR register */
#define TC_CTRLBCLR_ONESHOT_Pos               _UINT8_(2)                                           /* (TC_CTRLBCLR) One-Shot Position */
#define TC_CTRLBCLR_ONESHOT_Msk               (_UINT8_(0x1) << TC_CTRLBCLR_ONESHOT_Pos)            /* (TC_CTRLBCLR) One-Shot Mask */
#define TC_CTRLBCLR_ONESHOT(value)            (TC_CTRLBCLR_ONESHOT_Msk & (_UINT8_(value) << TC_CTRLBCLR_ONESHOT_Pos)) /* Assignment of value for ONESHOT in the TC_CTRLBCLR register */
#define TC_CTRLBCLR_CMD_Pos                   _UINT8_(6)                                           /* (TC_CTRLBCLR) Command Position */
#define TC_CTRLBCLR_CMD_Msk                   (_UINT8_(0x3) << TC_CTRLBCLR_CMD_Pos)                /* (TC_CTRLBCLR) Command Mask */
#define TC_CTRLBCLR_CMD(value)                (TC_CTRLBCLR_CMD_Msk & (_UINT8_(value) << TC_CTRLBCLR_CMD_Pos)) /* Assignment of value for CMD in the TC_CTRLBCLR register */
#define   TC_CTRLBCLR_CMD_NONE_Val            _UINT8_(0x0)                                         /* (TC_CTRLBCLR) No action  */
#define   TC_CTRLBCLR_CMD_RETRIGGER_Val       _UINT8_(0x1)                                         /* (TC_CTRLBCLR) Force start, restart or retrigger  */
#define   TC_CTRLBCLR_CMD_STOP_Val            _UINT8_(0x2)                                         /* (TC_CTRLBCLR) Force stop  */
#define TC_CTRLBCLR_CMD_NONE                  (TC_CTRLBCLR_CMD_NONE_Val << TC_CTRLBCLR_CMD_Pos)    /* (TC_CTRLBCLR) No action Position */
#define TC_CTRLBCLR_CMD_RETRIGGER             (TC_CTRLBCLR_CMD_RETRIGGER_Val << TC_CTRLBCLR_CMD_Pos) /* (TC_CTRLBCLR) Force start, restart or retrigger Position */
#define TC_CTRLBCLR_CMD_STOP                  (TC_CTRLBCLR_CMD_STOP_Val << TC_CTRLBCLR_CMD_Pos)    /* (TC_CTRLBCLR) Force stop Position */
#define TC_CTRLBCLR_Msk                       _UINT8_(0xC5)                                        /* (TC_CTRLBCLR) Register Mask  */


